app/controllers/admins/courses_controller.rb

SELECT "inscriptions".* FROM "inscriptions" WHERE (course_id = 7 and kind = 0)
---
  def show
    @profesor = Inscription.where("course_id = ? and kind = ?", @course.id, 0)