app/controllers/admins/inscriptions_controller.rb

DELETE FROM "inscriptions" WHERE "inscriptions"."id" = ?  [["id", 10]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def destroy
    @inscription.destroy
    redirect_to admins_course_path(Course.find(@inscription.course_id)), notice: 'Usuario removido satisfactoriamente del curso'

SELECT  "inscriptions".* FROM "inscriptions" WHERE "inscriptions"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def set_inscription
    @inscription = Inscription.find(params[:id])