app/views/admins/courses/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
        <tr>
          <td><%= i.user.firstname %></td>