app/views/inscriptions/courses.html.erb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
          <td>
            <%= Course.find(inscription.course_id).name.capitalize! %>