app/views/courses/info.html.erb

      <tr>
        <td><%= i.user.firstname %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]