app/controllers/courses_controller.rb

SELECT "inscriptions".* FROM "inscriptions" WHERE (course_id = 7 and kind = 0)
---
  def info
    @list_course = Inscription.where("course_id = ?", @course.id)