app/controllers/inscriptions_controller.rb

SELECT "inscriptions".* FROM "inscriptions" WHERE "inscriptions"."user_id" = ?  [["user_id", 4]]
---
  def courses
    @inscriptions = Inscription.where(user_id: current_user.id)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "inscriptions".* FROM "inscriptions" WHERE (user_id = 11 and course_id = 7) LIMIT ?  [["LIMIT", 1]]
INSERT INTO "inscriptions" ("created_at", "updated_at", "user_id", "course_id", "kind") VALUES (?, ?, ?, ?, ?)  [["created_at", "2018-09-11 20:12:59.140394"], ["updated_at", "2018-09-11 20:12:59.140394"], ["user_id", 11], ["course_id", 7], ["kind", 1]]
---
  def create
    if helpers.get_inscription(current_user, Course.find(params[:course_id])).nil?
      @inscription = Inscription.new(user_id: current_user.id, course_id: params[:course_id])
      @inscription.student!
      @inscription.save