app/controllers/inscriptions_controller.rb

  def new
    @inscription = Inscription.create(user_id: current_user.id, course_id: params[:id], kind: "Alumno")
---
INSERT INTO "inscriptions" ("created_at", "updated_at", "user_id", "course_id", "kind") VALUES (?, ?, ?, ?, ?)  [["created_at", "2018-09-11 19:05:56.678817"], ["updated_at", "2018-09-11 19:05:56.678817"], ["user_id", 9], ["course_id", 7], ["kind", 1]]